{
  "backend/main.mo": "Main Motoko actor for the MOBIUS-NOVA backend that handles four types of form submissions: test site applications, investor inquiries, partnership inquiries, and general inquiries, storing each in separate Maps with generated IDs.",
  "backend/migration.mo": "Migration module that defines the old and new actor state shapes and initializes empty Maps for all four inquiry/application types during canister upgrades.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their titles, associated source files, component dependencies, and test IDs for the MOBIUS-NOVA landing page build.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose and content, serving as a reference index for all components, pages, hooks, and config files in the project.",
  "frontend/index.css": "Root Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens used by shadcn-ui components.",
  "frontend/index.html": "HTML entry point for the MOBIUS-NOVA app that sets the page title, imports Montserrat (400 and 700) from Google Fonts, and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with five routes (/, /about, /technology, /features, /contact) and renders the RouterProvider.",
  "frontend/src/components/BenefitsSection.tsx": "Empty file placeholder for the BenefitsSection component.",
  "frontend/src/components/CallToActionSection.tsx": "Empty file placeholder for the CallToActionSection component.",
  "frontend/src/components/DeploymentsSection.tsx": "Deployments section component rendering a 2×2 responsive grid of product render cards (Off-Grid Cabin, Farm, Mars Colony, CAD Detail) with images, Nova Gold titles, descriptions, and Cosmic Blue badges.",
  "frontend/src/components/FeaturesSection.tsx": "Empty file placeholder for the FeaturesSection component.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with the brand logo, tagline, social media icon links, quick navigation links that smooth-scroll to page sections, and a copyright notice.",
  "frontend/src/components/FounderExpertiseSection.tsx": "Empty file with no content or exports.",
  "frontend/src/components/GetInvolvedSection.tsx": "Renders a dual-form section for investor and partner contact submissions, with validation, loading/success/error states, and dropdowns for investment range and partnership type.",
  "frontend/src/components/HeroSection.tsx": "Renders the full-screen hero section with the company logo, tagline, headline, CTA buttons linking to investor and test-site sections, and a scroll-down indicator.",
  "frontend/src/components/InvestorOpportunitySection.tsx": "Renders the investor opportunity section with four value-proposition cards (market, technology, timing, IP), investment tier details, and a CTA button scrolling to the contact form.",
  "frontend/src/components/KeySpecsSection.tsx": "Displays a grid of engineering specifications (power output, dimensions, bearing system, energy modes, ROI timeline) for the Frictionless Power Core with a disclaimer note.",
  "frontend/src/components/TechnologySection.tsx": "Renders the technology section showcasing two infographic images of the Frictionless Power Core and engineering analysis, plus three feature callout cards covering multi-modal core, frictionless bearings, and advanced materials.",
  "frontend/src/components/TestSiteSection.tsx": "React component rendering a form section for users to apply as early test sites for the MOBIUS-NOVA system, with fields for contact info, property type, and energy sources, plus validation and submission state handling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useContactSubmissions.ts": "Custom hook providing submit and reset functions with loading/success/error state for both investor and partnership inquiry form submissions via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module noting that React Query hooks for backend integration exist in other files; exports nothing.",
  "frontend/src/hooks/useTestSiteSubmission.ts": "Custom hook that handles submitting a test site application to the backend actor, managing loading, success, and error states.",
  "frontend/src/index.css": "Global stylesheet defining MOBIUS-NOVA brand CSS custom properties (colors, backgrounds) and Tailwind utility classes for brand colors, gradients, and shadows.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying MOBIUS-NOVA's mission, values, and team information with a hero section, mission statement, and styled content cards.",
  "frontend/src/pages/ContactPage.tsx": "Contact page for MOBIUS-NOVA with a hero section, a controlled contact form (name, email, company, message), and contact info cards displaying mail, phone, and location details.",
  "frontend/src/pages/FeaturesPage.tsx": "Features page listing eight capability cards (e.g., Multi-Modal Single Core, Scalable Architecture, Smart Monitoring) with icons, descriptions, and the site's dark space theme.",
  "frontend/src/pages/LandingPage.tsx": "Root landing page that composes all major section components (Hero, Technology, Deployments, KeySpecs, InvestorOpportunity, TestSite, GetInvolved, Footer) in order.",
  "frontend/src/pages/TechnologyPage.tsx": "Dedicated technology page with a full-bleed hero image, a 'How It Works' grid explaining wind and hydro energy capture, and additional technical detail sections using the brand's dark theme.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom brand colors (deep-space-black, nova-gold, cosmic-blue, liquid-silver), Montserrat font family, container settings, accordion animations, and plugins (typography, container-queries, animate).",
  "project_state.json": "Project state manifest (version 3) documenting MOBIUS-NOVA's brand guidelines, architectural notes, existing features, known issues, and required/edited image assets for the investor-facing landing page."
}