{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no functionality implemented.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: removal of newsletter signup bar and statistics section from CallToActionSection component.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component purposes, styling, and recent changes including the FounderExpertiseSection addition.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color variables for light and dark themes, including MOBIUS-NOVA brand colors and base styling.",
  "frontend/index.html": "HTML entry point with MOBIUS-NOVA title and Montserrat font import from Google Fonts.",
  "frontend/src/App.tsx": "Root application component that renders the LandingPage component.",
  "frontend/src/components/BenefitsSection.tsx": "Two-column benefits section displaying six value propositions with Nova Gold check icons, Cosmic Blue hover effects, and uppercase headings.",
  "frontend/src/components/CallToActionSection.tsx": "Call-to-action section with email signup form and gradient button, with newsletter text and statistics previously removed per feature requirements.",
  "frontend/src/components/FeaturesSection.tsx": "Features section displaying six capability cards in a grid, leading with Multi-Modal Single Core technology and using MOBIUS-NOVA brand colors with hover effects.",
  "frontend/src/components/Footer.tsx": "Footer component with MOBIUS-NOVA branding, social media links, navigation columns, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/FounderExpertiseSection.tsx": "Centered section displaying pilot partnership messaging with 'Seeking first pilot installation partners' headline and pre-commercial prototype stage subheading using brand styling.",
  "frontend/src/components/HeroSection.tsx": "Hero section component displaying the MOBIUS-NOVA logo, tagline, hero content with CTA buttons, and animated background gradients with scroll-to-features functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor instance, switching between authenticated and anonymous actors based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file reserved for future React Query hooks when backend integration is needed.",
  "frontend/src/index.css": "Global CSS with Tailwind directives, MOBIUS-NOVA brand color definitions using OKLCH color space, custom utility classes, and dark theme configuration.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page component that composes all sections (Hero, Features, Founder Expertise, Benefits, CTA, Footer) with dark gradient background.",
  "frontend/tailwind.config.js": "Tailwind configuration defining MOBIUS-NOVA brand colors in OKLCH format, Montserrat font family, container settings, custom animations, and plugin integrations.",
  "project_state.json": "Project state tracking document containing brand guidelines, architectural notes, feature history, and requirements for the MOBIUS-NOVA landing page."
}