{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: dedicated page components with brand styling, React Router navigation integration, and image asset display configuration.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the MOBIUS-NOVA landing page architecture with TanStack Router, brand styling, and page components.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, defining the design system foundation.",
  "frontend/index.html": "HTML entry point loading Montserrat font from Google Fonts and mounting the React application to the root div.",
  "frontend/src/App.tsx": "TanStack Router configuration defining routes for landing, about, technology, features, and contact pages with proper route tree structure.",
  "frontend/src/components/BenefitsSection.tsx": "Two-column benefits section displaying six value propositions with Nova Gold check icons, Cosmic Blue hover effects, and brand-styled cards.",
  "frontend/src/components/CallToActionSection.tsx": "Email signup CTA section with gradient background, input field with mail icon, and Nova Gold to Cosmic Blue gradient button.",
  "frontend/src/components/FeaturesSection.tsx": "Three-column grid showcasing six capability cards with icons, leading with Multi-Modal Single Core technology and using MOBIUS-NOVA brand colors with hover effects.",
  "frontend/src/components/Footer.tsx": "Footer component with brand logo, social media links (Facebook, X, LinkedIn, Instagram), navigation columns for Solutions and Company, and copyright information with privacy/terms links.",
  "frontend/src/components/FounderExpertiseSection.tsx": "Section component displaying a call-to-action for pilot installation partners, emphasizing the pre-commercial prototype stage with decorative gradient backgrounds.",
  "frontend/src/components/HeroSection.tsx": "Hero section with MOBIUS-NOVA logo image, tagline, headline, CTA buttons, and animated scroll indicator with decorative floating background elements.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor, switching between authenticated and anonymous actors based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file reserved for future React Query hooks when backend integration is needed.",
  "frontend/src/index.css": "Tailwind CSS configuration with MOBIUS-NOVA brand colors (liquid-silver, nova-gold, cosmic-blue, etc.) defined as CSS custom properties with utility classes and custom animations.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider for state management and authentication.",
  "frontend/src/pages/AboutPage.tsx": "About page with hero section featuring background image, mission statement with Target/Lightbulb/Users icons, and company values in a card layout.",
  "frontend/src/pages/ContactPage.tsx": "Contact page component with a hero section featuring a header image, contact form with name/email/company/message fields, and form state management using React hooks.",
  "frontend/src/pages/FeaturesPage.tsx": "Features page showcasing MOBIUS-NOVA capabilities in a grid layout with icons, including multi-modal core, scalability, weather resilience, zero emissions, 24/7 power, cost effectiveness, smart monitoring, and minimal footprint.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page component that composes multiple sections (Hero, Features, Founder Expertise, Benefits, Call to Action, Footer) with a dark gradient background theme.",
  "frontend/src/pages/TechnologyPage.tsx": "Technology page explaining the multi-modal energy system with hero section, detailed breakdowns of wind and hydro energy capture mechanisms, and technical specifications using icon-based cards.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom MOBIUS-NOVA brand colors (liquid-silver, nova-gold, cosmic-blue, etc.), Montserrat font family, container settings, and animation keyframes using OKLCH color space.",
  "project_state.json": "Project state file documenting MOBIUS-NOVA branding guidelines (full caps name, Montserrat font, color palette), architectural notes, required images for technology/about/contact pages, and feature implementation history."
}