{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: removing founder/veteran content from section 5 and replacing it with pilot partnership messaging in FounderExpertiseSection.tsx.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the landing page structure, component purposes, and MOBIUS-NOVA brand styling implementation.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark themes, including custom CSS variables for the design system.",
  "frontend/index.html": "HTML entry point that loads Montserrat font from Google Fonts and mounts the React application at #root.",
  "frontend/src/App.tsx": "Root React component that renders the LandingPage component.",
  "frontend/src/components/BenefitsSection.tsx": "Two-column section displaying six benefit cards with Nova Gold check icons, hover effects, and an \"Infinite Possibilities\" callout card.",
  "frontend/src/components/CallToActionSection.tsx": "Email signup section with gradient button, input field, and three statistics (10K+ installations, 99.9% uptime, 50M+ kWh generated).",
  "frontend/src/components/FeaturesSection.tsx": "Grid of six feature cards highlighting Multi-Modal Single Core technology as the primary differentiator, with icons and hover effects using brand colors.",
  "frontend/src/components/Footer.tsx": "Footer with MOBIUS-NOVA branding, social media links, navigation columns, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/FounderExpertiseSection.tsx": "Centered section displaying pilot partnership messaging with two text blocks: \"Seeking first pilot installation partners\" and \"Pre-commercial prototype stage — be among the first\".",
  "frontend/src/components/HeroSection.tsx": "Hero section component displaying the MOBIUS-NOVA logo, tagline, hero content with CTA buttons, and animated background gradients with scroll-to-features functionality.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor, switching between authenticated and anonymous actors based on Internet Identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file reserved for future React Query hooks when backend integration is needed.",
  "frontend/src/index.css": "Global styles defining MOBIUS-NOVA brand colors (liquid silver, nova gold, cosmic blue, etc.) using OKLCH color space, Tailwind base configuration, and custom utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/LandingPage.tsx": "Main landing page component composing HeroSection, FeaturesSection, FounderExpertiseSection, BenefitsSection, CallToActionSection, and Footer with dark gradient background.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with MOBIUS-NOVA brand colors, Montserrat font family, custom animations, and container settings.",
  "project_state.json": "Project state tracking document listing architectural notes, brand guidelines (MOBIUS-NOVA branding, Montserrat font, color palette), and implemented features for the landing page."
}