{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace founder expertise content with pilot partnership messaging",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Remove founder Navy ET background, veteran-founded messaging, and multi-modal technology differentiation content from FounderExpertiseSection",
      "acceptanceCriteria": [
        "All content in the seven selected elements (XPath /html[1]/body[1]/div[1]/div[1]/section[5]/div[2]/div[3]/div[1] through div[3]/div[2]) is removed",
        "No Navy ET background messaging remains visible",
        "No veteran-founded messaging remains visible",
        "No multi-modal technology differentiation content remains visible"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FounderExpertiseSection.tsx",
          "operation": "modify",
          "description": "Remove all existing content from the seven selected div elements within section[5] that currently display founder Navy ET background, veteran-founded status messaging, technical expertise highlights, military-grade precision content, and multi-modal technology differentiation. Clear the text content, headings, and descriptive paragraphs from these elements while maintaining the section structure and container hierarchy."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add pilot partnership messaging to replace removed founder expertise content",
      "acceptanceCriteria": [
        "The text 'Seeking first pilot installation partners' is displayed in the selected section",
        "The text 'Pre-commercial prototype stage — be among the first' is displayed in the selected section",
        "Both messages use MOBIUS-NOVA brand typography and styling consistent with other landing page sections",
        "The messages are arranged in a visually appealing layout within the existing section structure"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FounderExpertiseSection.tsx",
          "operation": "modify",
          "description": "Replace the cleared content in section[5] with two new pilot partnership messages: 'Seeking first pilot installation partners' and 'Pre-commercial prototype stage — be among the first'. Apply MOBIUS-NOVA brand styling using Montserrat font family, brand colors (liquid-silver, nova-gold, cosmic-blue), and typography guidelines consistent with other landing page sections. Arrange the messages in a visually appealing layout within the existing div structure, using appropriate heading levels, spacing, and alignment to match the overall landing page design system."
        }
      ]
    }
  ]
}